
## Plan Result (management/multi_account)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2937203258)


<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.organizations.aws_organizations_account.this[&#34;audit&#34;]
  * module.organizations.aws_organizations_account.this[&#34;log&#34;]
  * module.organizations.aws_organizations_account.this[&#34;management&#34;]
  * module.organizations.aws_organizations_account.this[&#34;portfolio&#34;]
  * module.organizations.aws_organizations_account.this[&#34;sandbox&#34;]
  * module.organizations.aws_organizations_organization.this
  * module.organizations.aws_organizations_organizational_unit.this[&#34;Sandbox&#34;]
  * module.organizations.aws_organizations_organizational_unit.this[&#34;Security&#34;]
  * module.organizations.aws_organizations_organizational_unit.this[&#34;WorkLoad&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.organizations.aws_organizations_account.this["audit"] will be created
  + resource "aws_organizations_account" "this" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "tqer39+aws-audit@gmail.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "Audit"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/multi_account"
        }
    }

  # module.organizations.aws_organizations_account.this["log"] will be created
  + resource "aws_organizations_account" "this" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "tqer39+aws-log@gmail.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "Log Archive"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/multi_account"
        }
    }

  # module.organizations.aws_organizations_account.this["management"] will be created
  + resource "aws_organizations_account" "this" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "tqer39+aws-management@gmail.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "Management"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/multi_account"
        }
    }

  # module.organizations.aws_organizations_account.this["portfolio"] will be created
  + resource "aws_organizations_account" "this" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "tqer39+aws-portfolio@gmail.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "Portfolio"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/multi_account"
        }
    }

  # module.organizations.aws_organizations_account.this["sandbox"] will be created
  + resource "aws_organizations_account" "this" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "tqer39+aws-sandbox@gmail.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "Sandbox"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/multi_account"
        }
    }

  # module.organizations.aws_organizations_organization.this will be created
  + resource "aws_organizations_organization" "this" {
      + accounts                      = (known after apply)
      + arn                           = (known after apply)
      + aws_service_access_principals = [
          + "access-analyzer.amazonaws.com",
          + "aws-artifact-account-sync.amazonaws.com",
          + "cloudtrail.amazonaws.com",
          + "config.amazonaws.com",
          + "controltower.amazonaws.com",
          + "guardduty.amazonaws.com",
          + "sso.amazonaws.com",
        ]
      + enabled_policy_types          = [
          + "SERVICE_CONTROL_POLICY",
        ]
      + feature_set                   = "ALL"
      + id                            = (known after apply)
      + master_account_arn            = (known after apply)
      + master_account_email          = (known after apply)
      + master_account_id             = (known after apply)
      + non_master_accounts           = (known after apply)
      + roots                         = (known after apply)
    }

  # module.organizations.aws_organizations_organizational_unit.this["Sandbox"] will be created
  + resource "aws_organizations_organizational_unit" "this" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Sandbox"
      + parent_id = (known after apply)
      + tags_all  = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/multi_account"
        }
    }

  # module.organizations.aws_organizations_organizational_unit.this["Security"] will be created
  + resource "aws_organizations_organizational_unit" "this" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Security"
      + parent_id = (known after apply)
      + tags_all  = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/multi_account"
        }
    }

  # module.organizations.aws_organizations_organizational_unit.this["WorkLoad"] will be created
  + resource "aws_organizations_organizational_unit" "this" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "WorkLoad"
      + parent_id = (known after apply)
      + tags_all  = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/multi_account"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":144,"Program":"tfcmt","SHA1":"c79708182080c6b5acc6c16a87dbb633fb7c4672","Target":"management/multi_account","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->